---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureURepeat
source: html/34b323ef-8892-23b8-920f-c3bd5990cc71.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureURepeat Property

The property labeled "U Repeat" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureURepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".